{
    "brand": "Amazing Grass",
    "name": "Amazing Grass Green Superfood Organic Powder with Wheat Grass and Greens, Flavor: Original, 30 Servings",
    "img-url": "https://images-na.ssl-images-amazon.com/images/I/5150Z4N%2BChL._SY300_QL70_.jpg",
    "star-rating": "4.2 out of 5 stars",
    "customer-reviews-count": "8,325 customer reviews",
    "details": [
        "Our most popular blend thoughtfully combines our alkalizing farm fresh greens and wholesome fruits and veggies with nutrient-rich superfoods for a delicious way to feel amazing every day.",
        "Crafted with 7 alkalizing farm fresh greens.",
        "3+ servings of greens, fruits and veggies. More organic greens than any other “greens” blend.",
        "Certified Organic by CCOF, Gluten Free, No Sugar Added, Plant Based, Non GMO, Kosher",
        "Add one scoop with 8 oz. or more of water, juice, or smoothie. 30 servings, 8.5 ounces"
    ],
    "short-reviews": [
        "Powder Tastes Like the Earth",
        "New formula is not the same as old formula",
        "JUST DRINK IT AND STOP COMPLAINING",
        "Great product for my bone cancer!",
        "The original isn't that original.  :(",
        "Old formula was better. I tried this with an open mind",
        "Hold your breath 🤷🏾‍♂️",
        "I enjoy them. I don't get a euphoric rush of ..."
    ],
    "long-reviews": [
        "This powder tastes like the earth. However, this is not a complaint. I have tried a few different green products over the years (some good, some bad). Often  I find that the products contain fillers, sugars, etc. to try to make them taste better or seem fancier. A good green product is one that simply tastes like the earth. :D This one does just that. It's a little harder to get down, but if you don't like the taste, you can always throw it in a smoothie or take it as a shot. Usually I'm rushing around for time, so I never have time to mix it in with a huge glass of water. So I prep two shot glasses with a little water, get it stirred in, and chase it with water. Down the hatch, on with life.I find that after a few weeks of regular use I was feeling extra energy and my mood was better. I wasn't having as hard of a time waking up in the morning (with this powder being the only change in my regular routine).Is it a miracle powder? Probably not. Will you walk on water after consuming it? Doubtful. Will you have more energy, be sick less often, and poop like a pro? Yeah. Yeah, you will.",
        "I've been consuming this for over 3 years and have been very pleased with the old formula. I got rid of my morning allergies, and didn't have to take the morning allergy medicine. I felt more energetic throughout the day, and rarely got sick. I didn't mind the taste so much until they changed to new formula. Initially when it came in the mail, I thought that it was just the packaging that changed. But the taste is horrible now and very grainy. They had changed their formula and cut the nutrition to nearly half. I will not be ordering this product anymore unless they change it to the old original formula. It is just not worth the money anymore.",
        "It has a distinct flavor with Vanilla Unsweetened Almond Milk BUT I plug my nose and chug. It's good for the body, and if I wanted something tasty I would've bought a cookie.",
        "I'd love to give this 10 on a scale of 5. I was recently diagnosed with chronic lymphocytic leukemia (CLL), which is essentially bone cancer, where the white blood cells become malignant, multiple, and crowd out the red blood cells. After taking it twice a day for about a month, I went back to my oncologist, who said test results showed my white blood count was down to normal levels. Although I still have CLL, and always will, he said he was really impressed!",
        "I notice the change in label and the poor reviews I've been seeing, but I just gotta try it for myself. Well, it turns out to be major dissapointment. It's no longer as affective as before. As you can see from the attached photos, a large amount of nutrient have been removed. How can you still call this the original? Im not buying this any more untill they put back the original ingredients.",
        "Old formula was better.I tried this with an open mind, but when compared to the old formula this does nothing.  I used to drink the old version of this product, and got a noticeable jolt of energy, my mind literally felt more clear and I felt GOOD.  I enjoyed the old version so much I even recommended it to friends.I tried this newer version, and got nothing out of it, no feeling of energy, no noticeable effects at all.I am highly disappointed this company went the route of all the other big companies which is to cheapen and lessen good ingredients to make more profit.  Clearly this is what happened.I give it 2 stars when it probably deserves a 1.  I am assuming it has to have some redeeming healthy qualities to it, but you won't notice them by drinking it.",
        "First of all ... it don’t taste like skittles by ANY meansSecondly.... That’s not the point of this productThird and finally... after three days I feel a huge difference in how my body is responding and that lets me know this product is filling in the correct nutritional gaps so I consider this a WIN... even though as far as taste in concerned I am going to have to muscle through until I get used to it",
        "I have been taking these greens for about 3+ years. I take them about 3 times a week. I enjoy them. I don't get a euphoric rush of energy. It's a more overall healthy feeling. when I take them consistently, I don't get sick. I like to like to boost during cold and flu season. I usually buy them from a local health store, but I noticed some really negative reviews here on Amazon and the new packaging. I needed to compare for myself. One thing to note is that the product did change a couple years ago. The texture was more raw gritty. Now it's more powder like. I figured they did this to make it blend better. That said, I noticed no difference. Smelled the same. Tastes the same. Feels the same. Packaging is different, but the nut label is the same."
    ]
}