{
    "brand": "Blink Home Security",
    "name": "Blink XT Home Security Camera System with Motion Detection, Wall Mount, HD Video, 2-Year Battery Life and Cloud Storage Included - 1 Camera Kit",
    "star-rating": "3.8 out of 5 stars",
    "customer-reviews-count": "3,247 customer reviews",
    "details": [
        "WEATHERPROOF FOR OUTDOOR OR INDOOR USE: Place and move your wireless Blink camera anywhere around your home both inside and out. Start off with a small system and expand to up to 10 cameras on one Blink Sync Module",
        "MOTION DETECTOR: Built-in motion sensor alarm, when motion detector is triggered, Wi-Fi cameras will send an alert to your smartphone and record a short clip of the event to the cloud",
        "BATTERY POWERED SECURITY SYSTEM: Wireless home camera with 2-year battery life, powered by 2 AA Lithium batteries (included), data is sent from IP cameras over Wi-Fi",
        "SMART HOME VIDEO SECURITY WITH HD VIDEO: Simple self-install home monitoring in minutes; easy to control wireless cameras with the free Blink Home Monitor iOS or Android app (Requires iOS 10.3 or Android 5 Lollipop or higher)",
        "FREE CLOUD STORAGE: Totally wire-free, with no monthly fees or service contract required"
    ],
    "short-reviews": [
        "Has a lot going for it. BUT!",
        "Great camera and customer service",
        "Paid for itself in less than 24-hours!!",
        "One major problem...."
    ],
    "long-reviews": [
        "I installed the Blink XT three camera outdoor system one month ago. The system has a lot of positive features but also lacks several things that would make it a great system. In the pro’s column I have the following: The system is reasonably priced. It is easy to set up. It is easy to install. It is totally wireless to the cameras. It has a clear quality picture. You can take a real time snapshot. You can watch a real time video. You can listen to live audio. You can arm or disarm the cameras manually or set an automatic schedule for when you want them armed or disarmed. You can arm or disarm individual cameras. There is no monthly fee for cloud storage of your recorded videos. In the con’s column I have the following: There isn’t a program for your computer that would allow you to watch the cameras live feed video on your computer. You cannot record while watching live feed video. The cameras thumbnail picture cannot be saved anywhere (I did discover that if you take a screen shot of your phone page you can send and save the picture). Also I would prefer that each cameras thumbnail picture be on its own page instead of together on one page. The audio feature is only one way you can listen while viewing live feed but you cannot respond and be heard. Extra mounting brackets are not available for purchase. If you want to move a camera temporarily to a new location you must unscrew the bracket to move it instead of just unsnapping the camera from the mount and snapping it onto the additional mount. Hopefully the tech department is working on these improvements. It will upgrade the Blink camera system from good to great!",
        "An excellent product with great customer service. I was somewhat concerned when others stated how bad the service was but I found that to not be true in my case. Bought this camera and had it up and running in just a few minutes. Excellent pics and video from the start, but found night vision on \"high\" was dark. Contacted customer service at Blink and within 12 hours had a reply stating they pushed a firmware update to my camera. Viola...it works as advertised and the night vision is now very good. Plus with re-aiming we now have zero false alerts. Would, and probably will, but this camera again.Update on July 26: The camera amazes and delights again and again.Fast trigger time, reliable clip notification and excellent pictures day and night. Catches every motion. When setting up, I used double sided tape (not included in my package although others say it was)  and moved the camera several times to get the best view, and so the slight view of our side street (we live on a corner) was blocked and the excess triggers immediately quit. Then I installed it by drilling and screwing the mount permanently.If there is any negative to this at all is the rather flimsy mount. It works as intended but wish Blink had a security mount offered as other brands do. In summary, can't say enough about this great camera and security device.Update August 17: Camera is still function great. I had some instances of lack of or slow notification to my phone when the motion sensor activated and found that even though the camera to wi-fi signal was three bars, that was often too low and the delay occurred. I added a wi-fi extender and the problem is solved. 5 Bars on the sync module and 5 bars on the camera too. And Blink customer service has been top notch yet again. Fast response and willingness to help.A final note is that some people seem to post here on the regular Blink camera instead of the Blink XT outdoor model. There is a huge difference in picture, motion sensing and night vision. If you buy but one camera, I'd suggest the Blink XT regardless of where you install it. It is just far superior to the standard indoor model.Update August 20....check out the fast motion detection and video quality. A hummingbird no less....Update September 18..Camera is still working flawlessly. Temperature on porch was 105 degrees several days and camera had no issues.Some complain about slow notifications, but this may be a flaw with certain smart phones rather than the system. For example, my spouses phone will alert within seconds of the motion detection while mine sometimes lags or not at all. In investigating this issue I found that LG phones frequently have this issue and even though I have different alerts for the Blink, I also find out that sometimes I do not receive text message alerts either. On the iPads the alert is fast and reliable. Phone lag or lack of alert is certainly not the fault of the camera. Still think these cameras are excellent.One thing to add is that some people are reviewing the standard Blink camera and not the Blink XT. In my opinion, they are totally different animals so be sure what you read is really the XT model.Update February 1, 2018: Still works great, we have about 15-20 clips a day and still on the original set of batteries. The notifications are no longer an issue, we get notifications each and every time the camera is triggered. Fast trigger time and the the night IR remains excellent. Ordering another today for the back area.",
        "Great system...installed Blink XT at 8 PM and filmed a car thief on our driveway at 3:01 AM.  Police now have a profile of the individual and are aware he is making rounds around the neighborhood.On the negative side, this system does not have a means to assign motion detection at specific quadrants of a video frame, so a tree swaying in the wind can trigger a recorded video.  Also, I wish the app was a bit more responsive.Sometimes it will make you wait 20 seconds to pull a recorded video from the Cloud, or may state SYSTEM BUSY when attempting to view a video alert...it needs to be quicker, as seconds count for authorities to respond promptly.That said, the price point is good and the performance is more than adequate.  We are happy overall.",
        "Bought the 3-camera set.  A reasonably priced solution for starters but one major issue that I think is really limiting.  It is the sync module and how it interacts with the cameras.  The cameras are of course WiFi and so you can put them pretty much anywhere you have decent wifi. The sync module also connects to wifi but also it apparently needs to connect directly to each camera (point-to-point).  There is the problem.  No matter how good coverage you have with wifi, you have to keep each camera within a certain range of the sync module.  That is hard to do if you have a big house.  With the sync module inside somewhere and the cameras outside your home, depending on how many walls there are to penetrate and materials used, you are going to be hard pressed to have the cameras very far away from the sync module.  The sync module should communicate with the cameras strickly over WiFi so wherever the camera works, the sync module works.Update 12/19/17:  I've had these up and running since the 1st of November and one of the 3 cameras has been chewing through batteries.  I have opened 3 separate tickets with the company...and each time I get a different person giving me the same runaround asking me about what type of batteries I used...and then they say they will get back to me to replace the camera and they never do."
    ]
}