{
    "name": "Simple Modern Ascent Water Bottle - Narrow Mouth, Vacuum Insulated, Double Wall, 18/8 Stainless Steel Powder Coated - 5 Sizes, 30+ Colors",
    "price": "$",
    "star-rating": "4.5 out of 5 stars",
    "customer-reviews-count": "1,268 customer reviews",
    "details": [
        "Double Walled, Vacuum Insulated - The Simple Modern Ascent water bottle is double wall and vacuum insulated. This technology keeps your beverage hot or cold for hours. Specific details for each size are listed in the description and the featured photos. No need for koozies or coasters! No matter the temperature of the liquid in this bottle, it will never sweat or be hot to the touch.",
        "Powder Coated 18/8 Stainless Steel - This insulated cup is made from premium gauge 18/8 stainless steel. We have chosen from the most popular colors, the powder coating is durable and gives the container a textured and vibrant finish. It is BPA free and FDA approved. It will never rust or leave a bad metal taste in your mouth.",
        "Narrow Mouth, Take It With You - 12oz, 16oz, 20oz and 24oz sizes fit in most cupholders, the 32oz is too big. The handle lid is double wall, adding more insulation to your beverage and preventing condensation. Internal threading on the narrow mouth Ascent lid makes for a more sleek bottle and easier drinking. The narrow mouth opening makes drinking easy and filling with ice is easy.",
        "Premium Copper Coated Insulation - The exterior of the inner wall, in the vacuum sealed area, has been dipped in copper for added insulation. Copper reduces the transfer of temperature, adding even more insulation to your container.",
        "Why Simple Modern? The S|M logo stands for more than premium drinkware. At our core, we believe that relationships are more valuable than profit. Generosity is one of our two core company values. We give a minimum of 10% of our profit away and have been able to donate product to natural disaster causes. Simple Modern products are all reusable, reducing waste in our landfills. Our products are designed to simplify your life, empowering you to be a positive impact on the people around you."
    ],
    "short-reviews": [
        "Good for Your Money",
        "GREAT PRODUCT, no disappointment",
        "Incredible, but rusty",
        "If you've scrolled this low, just purchase it.",
        "... LID ATTACHMENT FROM \"the coldest water straw lid fits perfect no leaking and it fits",
        "Affordable brand.",
        "Fantastic bottle!",
        "Pretty, holds up to description, and good quality."
    ],
    "long-reviews": [
        "For $20 less than Hydro flask, this model exceed my expectations. Only difference between s/m and hydro flask water bottle is the lid. The lid on Hydro flask can move with you and is thicker. The S/M model seems inexpensive but does the job. Both claimed to hold temperature for 24 hours and so far both meet those expectations.",
        "1st of all I AM NOT associated with the company nor given a free product for a review.  I bought two of these flasks since I fish four to five days a week and also use it  a lot for hiking and skiing.  Latest trip in May 8th 2017 to Moab Utah, Canyon Lands, Goblin Valley, Slick Rock temperature ranged from  75 to 95 degrees, my $9.99 flask out performed my wife's $37 flask.  Before each outing I put in five ice cubes in each flask with same amount of water and than put it in my back pack for a long hike.  After five hours $37 flask does not have any ice left but the $9.99 flask from Amazon still had a lot of ice. I have never given 5 stars for any product that I have purchased from Amazon or Ebay.  I  am extremely  happy with this product and I feel that you will too.",
        "I had planned on giving this bottle 5 stars.I was going on a 3 day trip for my geology class and filled the water bottle completely with ice at 5:50 am on Tuesday morning. The bottle spent all day in the car in 90 degree heat both Tuesday and Wednesday. When I opened the bottle Thursday morning I was incredibly impressed to see that I still had about 3/4 of the ice! I was so stoked and would have written a review right away had I not been at the National Monument without wifi. Now I'm glad I waited. I went to class today happily with my new favorite bottle filled with ice water. I went to take a drink and noticed RUST. Ew. So yes the bottle is incredible at keeping ice and water cold but the rust completely ruined this for me.",
        "I'm so glad I stumbled upon this product!! Less than $18, 1 day shipping with prime, and so many color options! Hopefully I can create a movement and start swaying people to let go of the hydroflask hype because these are so much more affordable.",
        "OMG U HAVE TO GET THIS CUP SO CUTE AND GET THE LID ATTACHMENT FROM \"the coldest water straw lid fits perfect no leaking and it fits!!! You just cut the straw but thats all!!! This is 20oz standard straw lid",
        "Let me just say, the straw attachment you see in my photos was purchased separately but does fit the bottle. I saw someone else recommend the “coldest water” flip cup attachment so I also bought it with my flask. With a little muscle it does fit and work great. I’m really happy with the color and it keeps my water cold for a long time, it was also packaged well. This beats spending $45 with other brands. I’m even buying my boyfriend one! I wish they had a larger flask but I got the largest on the 32 oz.",
        "I basically started out my steel water bottle obsession with a 20 oz Simple Modern water bottle. It's a fantastic thing to have. I work in the health field and I try to keep water on hand at my desk. I've always done the standard plastic tumblers, but the cup would sweat and make a watery mess next to the computer, and the ice would melt within about an hour.I got the Simple Modern bottle, and I haven't looked back - which may sound like a silly thing to say, but I'm honestly never going to go back to crappy plastic tumblers and cups. This bottle has kept solid ice for as long as 48 hours (72 if you count a small sliver of ice to be \"ice\") and has kept my drink cold for about 72 hours, even when the ice is gone. Also a plus, this bottle doesn't sweat/get condensation on it. The colorful exterior is easy to wipe down if it gets wet, and it stays dry. No more water all over the desk next to my computer because the ice is melting uncontrollably on the inside.The only thing I have to say negatively about this bottle is that the narrow mouth is difficult to find lids for. They make the screw on lids, but I've had a couple incidences of spilling water all over myself because I've been used to having some sort of mouth piece or straw to keep spillage in control.That being said, it's still a 5 star rating from me. The benefits have much outweighed the one negative aspect, and especially at such a good price. I paid $13 for my bottle, and I'd honestly be willing to pay more for a bigger one. In fact, I already did get one twice the size.The bottles with the wide-mouth fit all standard wide-mouth lids from other manufacturers, typically without any issues. I do appreciate that I can buy a Hydroflask lid to fit a Simple Modern bottle.Once again, 5 stars from me. I've had no reason to dislike any of the bottles I've had at all. Super pleased.",
        "I love this water bottle. I recently moved to this 20oz bottle from a plastic water bottle with a straw due to mold buildup that I just didn't want to deal with having to bleach every week or so.This bottle really does keep water cold for 24 hours. I put ice water in at 3PM and it was still very cold at 12PM the next day, even after sitting in a hot car for a few hours. It also hasn't leaked on me yet, which I find is a big ask for almost any bottle I've owned.Fits in cupholders, as stated in the description. The powder coating is beautiful and is actually nice to touch-- it gives the bottle some grip, adds a nice light matte finish, and feels \"softer\" than just metal bottles. I've also noticed there is no weird metal taste or smell like I've had while using some other metal bottles, which is a big plus.All in all, I've only had this bottle for a few days but I'm smitten."
    ]
}